index.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>EyeQ Documentation</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-20 09:41:07 PST"/>
<meta name="author" content="Vimalkumar"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">EyeQ Documentation</h1>

<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-38677203-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[1]; s.parentNode.insertBefore(ga, s);
  })();

</script>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What is EyeQ? </a></li>
<li><a href="#sec-2">2 Getting started </a>
<ul>
<li><a href="#sec-2_1">2.1 Repositories </a></li>
<li><a href="#sec-2_2">2.2 Downloading </a></li>
<li><a href="#sec-2_3">2.3 Compiling </a></li>
<li><a href="#sec-2_4">2.4 Installing </a></li>
<li><a href="#sec-2_5">2.5 Usage </a>
<ul>
<li><a href="#sec-2_5_1">2.5.1 Creating tenants </a></li>
<li><a href="#sec-2_5_2">2.5.2 Removing tenants </a></li>
<li><a href="#sec-2_5_3">2.5.3 Parameters </a></li>
<li><a href="#sec-2_5_4">2.5.4 Saving and restoring configurations </a></li>
<li><a href="#sec-2_5_5">2.5.5 Unloading EyeQ </a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Trying things out </a>
<ul>
<li><a href="#sec-3_1">3.1 Mininet </a></li>
</ul>
</li>
<li><a href="#sec-4">4 Rate limiter </a>
<ul>
<li><a href="#sec-4_1">4.1 Obtaining, Compiling and Installing </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is EyeQ? </h2>
<div class="outline-text-2" id="text-1">

<p>EyeQ is a distributed transport layer for your datacenter, which
provides predictable transmit <span style="text-decoration:underline;">and</span> receive bandwidth guarantees (over
few ms) to VMs/services on a server, without having to configure CoS
queues in your network for every VM/service.
</p>
<p>
For more details, check:
</p><ul>
<li>A short <a href="https://raw.github.com/jvimal/eyeq/master/README">README</a>.
</li>
<li>Comprehensive system design and evaluation in NSDI 2013:
  <a href="http://www.stanford.edu/~jvimal/EyeQ-NSDI13.pdf">http://www.stanford.edu/~jvimal/EyeQ-NSDI13.pdf</a>
</li>
<li>A position <a href="https://www.usenix.org/system/files/conference/hotcloud12/hotcloud12-final38.pdf">workshop paper</a>, <a href="https://www.usenix.org/conference/hotcloud12/eyeq-practical-network-performance-isolation-multi-tenant-cloud">talk and slides</a> at HotCloud 2012.
</li>
<li><a href="http://stanford.edu/~jvimal/eyeq/EyeQ-Eurosys-Poster.pdf">Poster at Eurosys 2013</a>.
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Getting started </h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2_1" class="outline-3">
<h3 id="sec-2_1"><span class="section-number-3">2.1</span> Repositories </h3>
<div class="outline-text-3" id="text-2_1">

<p>I maintain two repositories for EyeQ.  One is for bleeding edge
development, and the other is for releases.  The bleeding edge
contains all branches with untested and unfinished code.  The release
branch is more stable.
</p>
<p>
The stable repository is here: <a href="http://github.com/jvimal/eyeq">http://github.com/jvimal/eyeq</a>.  The
bleeding edge repository is under an older project name:
<a href="http://github.com/jvimal/perfiso_10g">http://github.com/jvimal/perfiso<sub>10g</sub></a>.
</p>
</div>

</div>

<div id="outline-container-2_2" class="outline-3">
<h3 id="sec-2_2"><span class="section-number-3">2.2</span> Downloading </h3>
<div class="outline-text-3" id="text-2_2">

<p>You can clone the github repositories, which has the source code to
compile the Linux kernel module:
</p>


<pre class="src src-bash">$ git clone https://github.com/jvimal/eyeq.git
</pre>



</div>

</div>

<div id="outline-container-2_3" class="outline-3">
<h3 id="sec-2_3"><span class="section-number-3">2.3</span> Compiling </h3>
<div class="outline-text-3" id="text-2_3">

<p>I have tested EyeQ with Linux 3.0 and above.  EyeQ is a kernel module
that implements a queueing discpline.  So you need the kernel headers
to compile EyeQ.  You can find available headers on your system in
<code>/lib/modules</code>.
</p>



<pre class="src src-bash">$ cd eyeq

$ ls /lib/modules/
3.2.0-23-generic

$ make
</pre>



<p>
This will produce the performance isolation kernel module called
<code>perfiso.ko</code> for your running kernel.  If you want to compile for a
different kernel, please edit the Makefile and change the version
number accordingly.
</p>
</div>

</div>

<div id="outline-container-2_4" class="outline-3">
<h3 id="sec-2_4"><span class="section-number-3">2.4</span> Installing </h3>
<div class="outline-text-3" id="text-2_4">

<p>EyeQ hooks into the transmit path by acting as a queueing discipline.
To avoid dependency on <code>iproute</code>, EyeQ replaces the hierarchical token
bucket (<code>htb</code>) module so you can use your existing <code>tc</code> tool to
install EyeQ.  So you need to remove <code>htb</code> before you can use EyeQ.
EyeQ hooks into the receive path using <code>netdev_rx_handler_register</code>
callback.
</p>
<p>
To install EyeQ on a device:
</p>


<pre class="src src-bash">$ rmmod sch_htb

$ insmod ./perfiso.ko

$ tc qdisc show
qdisc pfifo_fast 0: dev eth0 root refcnt 2 bands 3 priomap...

$ tc qdisc add dev eth0 root handle 1: htb

$ dmesg | tail
perfiso: Init TX path for eth0
perfiso: Init RX path for eth0

$ tc qdisc show
qdisc htb 1: dev eth0 root
</pre>



</div>

</div>

<div id="outline-container-2_5" class="outline-3">
<h3 id="sec-2_5"><span class="section-number-3">2.5</span> Usage </h3>
<div class="outline-text-3" id="text-2_5">

<p>We provide a separate python configuration tool to work with EyeQ, as
it does not use the standard <code>tc</code> interface.  EyeQ kernel module
exports a sysfs file which it uses for all configuration mechanisms.
</p>

</div>

<div id="outline-container-2_5_1" class="outline-4">
<h4 id="sec-2_5_1"><span class="section-number-4">2.5.1</span> Creating tenants </h4>
<div class="outline-text-4" id="text-2_5_1">

<p>EyeQ lets you filter tenants using IP addresses.  Filters are needed
to correctly classify packets to their corresponding groups for proper
resource accounting.  We use the source IP on the transmit path, and
destination IP on the receive path.  Implementing classifiers is easy,
but contact me if you need a particular classifier in EyeQ and I can
make it available.
</p>
<p>
Each tenant has a classifier and a "weight" that denotes the relative
importance of one tenant over another.  If you have two tenants A and
B with weights 1 and 2 respectively, then tenant B will get twice the
bandwidth of A whenever there is contention for bandwidth
(transmit/receive).  It is possible to set unequal weights for
transmit and receive by directly writing to EyeQ's sysfs files.
</p>
<p>
For example, to create a tenant with IP address 10.0.1.1, do:
</p>



<pre class="src src-bash">$ tools/pi.py --create 10.0.1.1 --dev eth0
INFO:root:Creating txc 10.0.1.1 on dev eth0
INFO:root:Creating vq 10.0.1.1 on dev eth0
INFO:root:Setting weight of vq 10.0.1.1 on dev eth0 to 1

$ tools/pi.py --list
dev: eth0
listing TXCs
        10.0.1.1 weight 1 assoc vq 10.0.1.1
listing VQs
        10.0.1.1 weight 1
</pre>



<p>
To set a different weight for tenant 10.0.1.1 on the receive path, do:
</p>


<pre class="src src-bash">$ echo dev eth0 10.0.1.1 weight 10 &gt; /sys/module/perfiso/parameters
</pre>



</div>

</div>

<div id="outline-container-2_5_2" class="outline-4">
<h4 id="sec-2_5_2"><span class="section-number-4">2.5.2</span> Removing tenants </h4>
<div class="outline-text-4" id="text-2_5_2">




<pre class="src src-bash">$ tools/pi.py --delete 10.0.1.1 --dev eth0
</pre>



</div>

</div>

<div id="outline-container-2_5_3" class="outline-4">
<h4 id="sec-2_5_3"><span class="section-number-4">2.5.3</span> Parameters </h4>
<div class="outline-text-4" id="text-2_5_3">

<p>EyeQ exposes a number of knobs to fine tune its operation.  In many
cases the default should just suffice.  The default parameters are
tuned for 10GbE.
</p>



<pre class="src src-bash">$ tools/pi.py --get
 1           ISO_RFAIR_INCREASE_INTERVAL_US        120
 2                  IsoAutoGenerateFeedback          1
 3               ISO_TOKENBUCKET_TIMEOUT_NS      50000
 4               ISO_TXC_UPDATE_INTERVAL_US        200
... a lot more.
</pre>



<p>
Stay tuned for a default set of parameters for 1GbE networks.
</p>
</div>

</div>

<div id="outline-container-2_5_4" class="outline-4">
<h4 id="sec-2_5_4"><span class="section-number-4">2.5.4</span> Saving and restoring configurations </h4>
<div class="outline-text-4" id="text-2_5_4">

<p>You can save the config as a json file which you can restore later.
</p>



<pre class="src src-bash">$ tools/pi.py --save /tmp/config
$ cat /tmp/config
{
    <span style="color: #8F9D6A;">"params"</span>: {
        <span style="color: #8F9D6A;">"ISO_RFAIR_INCREASE_INTERVAL_US"</span>: <span style="color: #8F9D6A;">"120"</span>,
        <span style="color: #8F9D6A;">"IsoAutoGenerateFeedback"</span>: <span style="color: #8F9D6A;">"1"</span>,
        <span style="color: #8F9D6A;">"ISO_TOKENBUCKET_TIMEOUT_NS"</span>: <span style="color: #8F9D6A;">"50000"</span>,
...
    },
    <span style="color: #8F9D6A;">"config"</span>: {
        <span style="color: #8F9D6A;">"eth0"</span>: {
            <span style="color: #8F9D6A;">"vqs"</span>: [
            ],
            <span style="color: #8F9D6A;">"txcs"</span>: [
                {
...
                }
            ]
        }
    }
}
</pre>



</div>

</div>

<div id="outline-container-2_5_5" class="outline-4">
<h4 id="sec-2_5_5"><span class="section-number-4">2.5.5</span> Unloading EyeQ </h4>
<div class="outline-text-4" id="text-2_5_5">

<p>You can unload EyeQ by first removing each qdisc you created on
network devices.
</p>



<pre class="src src-bash">$ tc qdisc del dev eth0 root
</pre>



<p>
You can restore an earlier configuration by running the following as
root:
</p>



<pre class="src src-bash">$ tools/pi.py --load /tmp/config
</pre>




</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Trying things out </h2>
<div class="outline-text-2" id="text-3">

<p>The scripts used in all our experiments in the NSDI paper are
available online in the <a href="https://github.com/jvimal/eyeq-tests">test repository</a>.
</p>

</div>

<div id="outline-container-3_1" class="outline-3">
<h3 id="sec-3_1"><span class="section-number-3">3.1</span> Mininet </h3>
<div class="outline-text-3" id="text-3_1">

<p><a href="http://mininet.github.com/">Mininet</a> is a collection of useful scripts to configure features such
as network namespaces, containers and <a href="http://lartc.org/">Linux Traffic Control</a>, to create
lightweight virtual networks on a single machine.  I am one of the
authors of the second release of Mininet, with Bob Lantz, Brandon
Heller and Nikhil Handigol.
</p>
<p>
Mininet uses <code>tc</code> to configure <code>htb</code> inorder to emulate links with of
some capacity.  So you can use Mininet to test EyeQ as well.
Unfortunately, one of Mininet's limitations (as of 2.0) is that you
are constrained to resources that one server can offer especially CPU.
One CPU core amounts to about 2&ndash;3Gb/s of aggregate switching
capacity.  So you can try EyeQ safely with few (10) links operating at
slower link speeds, say 10&ndash;100Mb/s.
</p>
<p>
The test repository has scripts to create a single-switch topology in
Mininet.  To test it on Mininet, just do the following steps:
</p>
<ol>
<li>Download and install Mininet-2.0 on Ubuntu 12.10+ by following
   Option 2 on the <a href="http://mininet.github.com/download/">Mininet Setup Page</a>.

<p>
   Alternatively, you can boot the AMI id <code>ami-7eab204e</code> in US-Oregon
   region in Amazon AWS which has Mininet-2.0 preinstalled.
</p>
</li>
<li>Install paramiko and termcolor dependencies.  On Ubuntu, just run:




<pre class="src src-bash">$ sudo apt-get install python-paramiko
$ sudo easy_install termcolor
</pre>



<p>
   Disable DNS resolution in ssh.  Add "UseDNS no" to
   <code>/etc/ssh/sshd_config</code>.  Then, run <code>sudo reload ssh</code> for changes to
   take effect.
</p>
</li>
<li>Clone the tests repository.



<pre class="src src-bash">$ cd ~/eyeq
$ git clone https://github.com/jvimal/eyeq-tests.git tests
$ cd tests
</pre>



</li>
<li>Ensure correct configuration:

<ul>
<li>SSH settings in <code>config/mininet.py</code>
</li>
<li>Edit <code>host.py</code> to import <code>config.mininet</code> instead of
     <code>config.packard</code>.

</li>
</ul>
</li>
<li>Run the Mininet script <code>sudo python mininet/simple.py</code> and wait for
   the CLI.

</li>
<li>Ensure you can log in from h1 to h2 without passwords.

<ul>
<li>In Mininet, type <code>xterm h1</code>
</li>
<li>You should be able to type <code>ssh 10.0.0.2</code> and log in without any
     hassles.  If you get "permission denied (public key)" or some
     such error, please add <code>/root/.ssh/id_rsa.pub</code> to
     <code>/root/.ssh/authorized_keys</code>.

</li>
</ul>
</li>
<li>Create tenants on all hosts.

<ul>
<li>In Mininet, type <code>xterm h1</code>
</li>
<li>Inside the terminal, type the following, which creates 3 tenants
     on each of the 3 virtual hosts (h1, h2 and h3): <code>python tenant.py      -m 3 -T 3</code>
</li>
<li>By default, the script will create tenants with IP addresses
     <code>11.0.T.M</code> where T is the tenant ID and M is the machine number
     (1 for h1, etc.).  Routing tables are set correctly so that
     packets destined to a tenant pick the corresponding source IP
     address.

</li>
</ul>
</li>
<li>Make a few parameter changes so things work at 100Mb/s instead of
   10Gb/s.




<pre class="src src-bash">$ cd ~/eyeq/

# Set the interface speed to 100Mb/s
$ tools/pi.py --set 18,100
Setting ISO_MAX_TX_RATE = 100

# Set the receive speed to 100Mb/s
$ tools/pi.py --set 5,100
Setting ISO_VQ_DRAIN_RATE_MBPS = 100

# Set the tokenbucket timeout value to 1ms
$ tools/pi.py --set 3,1000000
Setting ISO_TOKENBUCKET_TIMEOUT_NS = 1000000

# Set the rate metering interval to 1ms
$ tools/pi.py --set 13,10000
Setting ISO_VQ_UPDATE_INTERVAL_US = 10000
</pre>



<p>
   There is a small bug in EyeQ because of which the tx and rx
   capacities of each tenant won't be recomputed after setting a new
   tx rate.  Until we fix it, here is a workaround, which will trigger
   a recompute:
</p>



<pre class="src src-bash">num_hosts=3
for i in `seq 1 $num_hosts`; do
        echo <span style="color: #8F9D6A;">"dev h$i-eth0 11.0.1.$i weight 1"</span> &gt; /sys/module/perfiso/parameters/set_txc_weight
        echo <span style="color: #8F9D6A;">"dev h$i-eth0 11.0.1.$i weight 1"</span> &gt; /sys/module/perfiso/parameters/set_vq_weight
done
</pre>



</li>
<li>Check TX fairness.

<ul>
<li>Run iperf servers (<code>iperf -s</code>) on all hosts.
</li>
<li>Run iperf client from h1:1 (tenant 1) to h2:1 (tenant 1)
<ul>
<li>h1 terminal: <code>iperf -c 11.0.1.2 -t 100 -i 1</code>
</li>
</ul>
</li>
<li>Run 4 flows from h1:2 to h3:2
<ul>
<li>h1 terminal: <code>iperf -c 11.0.2.3 -t 100 -i 1 -P4</code>

</li>
</ul>
</li>
</ul>
   You should see each iperf get 50Mb/s.

</li>
<li>The stats command all work in Mininet as well.




<pre class="src src-bash">$ tools/pi.py --stats --dev h1-eth0
</pre>


</li>
</ol>
   The above scripts are available in <code>tests/mininet/100mbps.sh</code>.

</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Rate limiter </h2>
<div class="outline-text-2" id="text-4">

<p>We have also implemented EyeQ's rate limiter, optimized for multiqueue
networking devices, as a drop-in replacement to Linux's Token Bucket
Filter (<code>tbf</code>).  You can download it from the ptb repository:
<a href="https://github.com/jvimal/ptb">https://github.com/jvimal/ptb</a>.
</p>

</div>

<div id="outline-container-4_1" class="outline-3">
<h3 id="sec-4_1"><span class="section-number-3">4.1</span> Obtaining, Compiling and Installing </h3>
<div class="outline-text-3" id="text-4_1">

<p>Since <code>ptb</code> is a drop-in replacement for <code>tbf</code>, you will have to
remove <code>tbf</code> from a running kernel before you can use <code>ptb</code>.  The
module is for Linux kernels 3.7 onwards, as the qdisc API
datastructures changed a bit.  However, the API change is simple so
you can easily port it to older kernels.
</p>



<pre class="src src-bash">$ rmmod sch_tbf
$ git clone https://github.com/jvimal/ptb.git
$ cd ptb
$ make
$ insmod ./sch_ptb.ko
</pre>



<p>
There is a sample script with default options so you can test PTB out.
Just like Linux's default <code>mq</code> or <code>mqprio</code> qdisc, <code>ptb</code> must be the
root qdisc.  It cannot be the child of any other qdisc.
</p>



<pre class="src src-bash">$ cat tc.sh
#!/bin/bash

dev=eth2
tc qdisc del dev $dev root
rmmod sch_ptb
make
insmod ./sch_ptb.ko
tc qdisc add dev $dev root handle 1: tbf limit 100000 burst 1000 rate 3Gbit
</pre>




</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> FOOTNOTE DEFINITION NOT FOUND: 0
</p>
</div>
</div>
<div id="postamble">
<p class="author">Author: Vimalkumar (<a href="mailto:j.vimal@gmail.com">j.vimal@gmail.com</a>)</p>
<p class="date">Date: 2013-02-20 09:41:07 PST</p>
<p class="creator">Generated by Org version 7.4 with Emacs version 24</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</div>
</body>
</html>
